Revit 2026 API

# ParameterTypeIdEnergyAnalysisGlazingIsShaded Property

---

"Glazing is Shaded"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisGlazingIsShaded As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisGlazingIsShaded {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisGlazingIsShaded : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace